tutorials/Figure10c/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoPhase
{
    transportModel  twoPhase;
    phase1          phase1;
    phase2          phase2;
}

//iso-Butane, 373K
phase1
{
    transportModel  		Newtonian;
    nu              		nu [ 0 2 -1 0 0 0 0 ] 2.96E-7;
    rho             		rho [ 1 -3 0 0 0 0 0 ] 958.8;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.5;
    cp				cp [ 0 2 -2 -1 0 0 0] 4200;
}

phase2
{
    transportModel		Newtonian;
    nu				nu [ 0 2 -1 0 0 0 0 ] 1.26E-6;
    rho				rho [ 1 -3 0 0 0 0 0 ] 9.59;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.5;
    cp				cp [ 0 2 -2 -1 0 0 0] 4200;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.06;
T_0			T_0 [0 0 0 1 0 0 0] 373;


thermalPhaseChange
{
	model       Energybalance_Correction;
	h_lv		h_lv  [0 2 -2 0 0 0 0 ] 2260000;
	T_sat		T_sat [0 0 0 1 0 0 0] 373;
	me		me    [0 0 0 0 0 0 0] 4;
	mcor		mcor  [0 0 0 0 0 0 0] 100;
}

surfaceTensionForce
{
	model      Brackbill;
}

// ************************************************************************* //
