tutorials/Figure10c/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.001";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
255
(
8.34775e-16
8.34775e-16
8.34775e-16
-4.4643e-08
-4.46435e-08
-4.46435e-08
-4.46435e-08
-4.46435e-08
...
)
;

boundaryField
{
    BotWall
    {
        type            calculated;
        value           uniform -8.34775e-16;
    }
    FreeStream
    {
        type            calculated;
        value           uniform -4.46435e-08;
    }
    FrontNBack
    {
        type            empty;
        value           nonuniform 0();
    }
    LeftSide
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    RightSide
    {
        type            symmetryPlane;
        value           uniform 0;
    }
}


// ************************************************************************* //
